# **Sorting, Distinct, Insert into Select and REPLACE**

## 1. ORDER BY - Sorting Data
The ORDER BY clause is used to sort the result set by one or more columns. The sorting can be done in ascending (ASC) or descending (DESC) order.

**Syntax:**

``` sql
SELECT column1, column2, ...
FROM table_name
ORDER BY column1 [ASC|DESC], column2 [ASC|DESC], ...;
```

### **Example** 
1. Sort the customers based on their city names in ascending order. 
2. Sort the orders based on total_amount.
3. Sort the products based on quantity in descending order to get most stocked products.
4. Sort the products based on price in descending order to get the most expensive products.

### **Combining multiple columns in ORDER BY**
You can sort the result set based on multiple columns. The result set is first sorted based on the first column specified in the ORDER BY clause, then the second column, and so on.

### **Example**
1. Sort the customers based on their city names in ascending order and then by their names in descending order.
2. Sort the orders based on total_amount in descending order and then by order_date in ascending order.
3. Get the top 10 most expensive products with lowest stocks to arrange their stock.
4. Get all the suppliers from 'Millerland' sorted by their names.

<hr>

## 2. DISTINCT - Removing Duplicates
The DISTINCT keyword is used to remove duplicates from the result set.

**Syntax:**

``` sql
SELECT DISTINCT column1, column2, ...
FROM table_name;
```

### **Example**
1. Get all the unique cities from the customers table.
2. Get all the unique product names from the products table.

## 3. Insert Into Select
This is used to select data from one table and put it into another without writing the manual queries for insertion.

**Syntax:**

``` sql
INSERT INTO table2
SELECT * FROM table1
WHERE condition;
```

## 4. REPLACE INTO 
This is used to insert a row into a table if the row does not exist, or to replace the row if it already exists.

**Syntax:**

``` sql
REPLACE INTO table_name (column1, column2, column3, ...)
VALUES (value1, value2, value3, ...);
```